Project/Toir.Adaptation/src/Documents/гкс_ВводДанныхПоТрудовымРесурсам/гкс_ВводДанныхПоТрудовымРесурсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bc7a0087-1c47-4d17-a91b-fe5d8008b7c7">
  <name>гкс_ВводДанныхПоТрудовымРесурсам</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="27294bfd-4105-4c88-9eb2-3d8f924a30b7">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="432c59d6-8210-4d3a-bd82-498bedd3de09">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5ed7c4c-7b4d-4d98-8c88-ca4690a6cb8f">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="62612d7a-ba8c-4628-918b-c3d9bd202fcc">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="6f7f7710-1319-4339-b8b4-e58c746ea2c5">
    <name>Трудозатраты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f1b93a08-d4be-4133-ba61-d4d3874fbc59">
      <name>ВидДвижения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5ecaaf6b-3d5c-4d00-9c1c-fa0407d6a6c9">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c0d5baa-3ad0-4ce3-b624-7ec25fefa7b1">
      <name>Квалификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="12e0eabf-0bcf-47ef-b378-4ca281bb9207">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="07028522-ad55-403b-a011-346950fcbdb1">
      <name>Должность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b2445faa-68a7-44b2-8c9f-96574d9f3c44">
      <name>ПериодПланирования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ab440c3b-dfbb-4617-9dd5-2a1c20ed17a8">
      <name>Доступно</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="47e86aa6-afae-4a24-a7db-28aa19ee94a3">
      <name>Запланировано</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/AccumulationRegisters/гкс_ТрудовыеРесурсы/гкс_ТрудовыеРесурсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9f937d74-0349-4b21-8be9-4928d9de626f">
  <name>гкс_ТрудовыеРесурсы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="7f8b7a62-c2e5-4d65-b391-72b56bbd5f98">
    <name>Доступно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b69e0054-a297-440f-8365-ebd2377f11bc">
    <name>Запланировано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="325251ab-78b1-4431-9d3b-9b12927a29b5">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b9b660dc-4b86-4334-ad17-f12c135fc881">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="27f52759-ab8e-41fc-86a8-2d6d52721ee8">
    <name>Квалификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="222f5501-5d54-4974-ac9e-7426d81ead27">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="247f2686-5bc7-43c1-9784-b3882a310bda">
    <name>ПериодПланирования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir.Adaptation/src/Enums/гкс_ВидДвижения/гкс_ВидДвижения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="69e98484-d3a5-454d-a324-4e74a2eb9852">
  <name>гкс_ВидДвижения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="483432be-83cb-4a8c-93db-ca2ab70843c5">
    <name>Приход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="eb588bd3-0636-4d5f-bc1e-8754d78b67dc">
    <name>Расход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Documents/гкс_ВводДанныхПоТрудовымРесурсам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&Вместо("ОбработкаПроведения")
Процедура гкс_ОбработкаПроведения(Отказ, РежимПроведения)
	
	ВыполнитьДвиженияРНТрудовыеРесурсы();
	КонтрольОстатков(Отказ);	
		
КонецПроцедуры

&Вместо("ОбработкаЗаполнения")
Процедура гкс_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда		
		ЗаполнитьДокументНаОснованииСтруктуры(ДанныеЗаполнения);		
	КонецЕсли;
КонецПроцедуры

&Вместо("ПриКопировании")
Процедура гкс_ПриКопировании(ОбъектКопирования)
	ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьДвиженияРНТрудовыеРесурсы()
	
	// ТрудовыеРесурсы
	Движения.гкс_ТрудовыеРесурсы.Записывать = Истина;
	Для Каждого ТекСтрокаТрудозатраты Из Трудозатраты Цикл

		Движение = Движения.гкс_ТрудовыеРесурсы.Добавить();
		Если ТекСтрокаТрудозатраты.ВидДвижения = ПредопределенноеЗначение("Перечисление.гкс_ВидДвижения.Расход") Тогда
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;   						
		Иначе
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;   					
		КонецЕсли; 
		Движение.Период         	= Дата;
		Движение.Организация	   	= Организация;
		Движение.Подразделение   	= ТекСтрокаТрудозатраты.Подразделение;
		Движение.Квалификация   	= ТекСтрокаТрудозатраты.Квалификация;
		Движение.Должность   		= ТекСтрокаТрудозатраты.Должность;
		Движение.Сотрудник   		= ТекСтрокаТрудозатраты.Сотрудник;
		Движение.ПериодПланирования = НачалоДня(ТекСтрокаТрудозатраты.ПериодПланирования);
		Движение.Доступно   		= ТекСтрокаТрудозатраты.Доступно;
		Движение.Запланировано   	= ТекСтрокаТрудозатраты.Запланировано;

	КонецЦикла;
	Движения.Записать();
	
КонецПроцедуры

Процедура КонтрольОстатков(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Трудозатраты.ВидДвижения КАК ВидДвижения,
	               |	&Организация КАК Организация,
	               |	Трудозатраты.Подразделение КАК Подразделение,
	               |	Трудозатраты.Квалификация КАК Квалификация,
	               |	Трудозатраты.Должность КАК Должность,
	               |	Трудозатраты.Сотрудник КАК Сотрудник,
	               |	Трудозатраты.ПериодПланирования КАК ПериодПланирования
	               |ПОМЕСТИТЬ ТабТрудозатраты
	               |ИЗ
	               |	&Трудозатраты КАК Трудозатраты";
	
	Запрос.УстановитьПараметр("Трудозатраты", Трудозатраты.Выгрузить());	
	Запрос.УстановитьПараметр("Организация", Организация);	
	Запрос.Выполнить();
	
    Запрос.Текст = ТекстЗапросаКонтрольОстатков_ТрудовыеЗатраты();
	 			
	Запрос.УстановитьПараметр("Дата", Новый Граница(Дата, ВидГраницы.Включая));
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ШаблонСообщения = НСтр("ru='Превышен лимит: Организация %1, Подразделение %2," 
								"Квалификация %3, Должность %4, Сотрудник %5, ПериодПланирования %6,'");
		
		ШаблонСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
		                                                        Выборка.Организация,
																Выборка.Подразделение,
																Выборка.Квалификация,
																Выборка.Должность,
																Выборка.Сотрудник,
																Формат(Выборка.ПериодПланирования,"ДФ=dd.MM.yyyy"));
		
	
		ОбщегоНазначения.СообщитьПользователю(ШаблонСообщения, ЭтотОбъект, , , );//Отказ);
		
	КонецЦикла;
	
КонецПроцедуры      

Процедура ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию()
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойОтветственный");
		Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
			Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ТекстЗапросаКонтрольОстатков_ТрудовыеЗатраты()
	
	Возврат "ВЫБРАТЬ
	        |	ТабТрудозатраты.Организация КАК Организация,
	        |	ТабТрудозатраты.Подразделение КАК Подразделение,
		    |	ТабТрудозатраты.Квалификация КАК Квалификация,
	        |	ТабТрудозатраты.Должность КАК Должность,
	        |	ТабТрудозатраты.Сотрудник КАК Сотрудник,
	        |	ТабТрудозатраты.ПериодПланирования КАК ПериодПланирования,
	        |	СУММА(ЕСТЬNULL(гкс_ТрудовыеРесурсыОстатки.ДоступноОстаток, 0)) КАК ДоступноОстаток
	        |ИЗ
	        |	ТабТрудозатраты КАК ТабТрудозатраты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.гкс_ТрудовыеРесурсы.Остатки(
	        |				&Дата,
	        |				(Организация, Подразделение, Квалификация, Должность, Сотрудник, ПериодПланирования) В
	        |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |						ТабТрудозатраты.Организация КАК Организация,
	        |						ТабТрудозатраты.Подразделение КАК Подразделение,
		    |						ТабТрудозатраты.Квалификация КАК Квалификация,
	        |						ТабТрудозатраты.Должность КАК Должность,
	        |						ТабТрудозатраты.Сотрудник КАК Сотрудник,
	        |						ТабТрудозатраты.ПериодПланирования КАК ПериодПланирования
	        |					ИЗ
	        |						ТабТрудозатраты КАК ТабТрудозатраты)) КАК гкс_ТрудовыеРесурсыОстатки
	        |		ПО ТабТрудозатраты.Организация = гкс_ТрудовыеРесурсыОстатки.Организация
	        |			И ТабТрудозатраты.Подразделение = гкс_ТрудовыеРесурсыОстатки.Подразделение
		    |			И ТабТрудозатраты.Квалификация = гкс_ТрудовыеРесурсыОстатки.Квалификация
	        |			И ТабТрудозатраты.Должность = гкс_ТрудовыеРесурсыОстатки.Должность
	        |			И ТабТрудозатраты.Сотрудник = гкс_ТрудовыеРесурсыОстатки.Сотрудник
	        |			И ТабТрудозатраты.ПериодПланирования = гкс_ТрудовыеРесурсыОстатки.ПериодПланирования
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ТабТрудозатраты.Организация,
	        |	ТабТрудозатраты.Подразделение,
		    |	ТабТрудозатраты.Квалификация,
	        |	ТабТрудозатраты.Должность,
	        |	ТабТрудозатраты.Сотрудник,
	        |	ТабТрудозатраты.ПериодПланирования
	        |
	        |ИМЕЮЩИЕ
	        |	СУММА(ЕСТЬNULL(гкс_ТрудовыеРесурсыОстатки.ДоступноОстаток, 0)) < 0";
		
КонецФункции

Процедура ЗаполнитьДокументНаОснованииСтруктуры(ДанныеЗаполнения) 	
	Дата = ДанныеЗаполнения.Дата;	
	Организация = ДанныеЗаполнения.Организация;	
	ВидОперации = ДанныеЗаполнения.ВидОперации;
	СтрокаТрудозатрат = Трудозатраты.Добавить();	
	ЗаполнитьЗначенияСвойств(СтрокаТрудозатрат, ДанныеЗаполнения);		
КонецПроцедуры   

#КонецОбласти

#КонецЕсли
